In [1]:
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import scipy.stats as st

# data files
SalaryDataFile = "Salaries.csv"

# Read the data file
SalaryData = pd.read_csv(SalaryDataFile)
SalaryData.head()

   yearID teamID lgID   playerID  salary
0    1985    ATL   NL  barkele01  870000
1    1985    ATL   NL  bedrost01  550000
2    1985    ATL   NL  benedbr01  545000
3    1985    ATL   NL   campri01  633333
4    1985    ATL   NL  ceronri01  625000

In [2]:
#read in csv files
salary_df = pd.read_csv(SalaryDataFile)

#filter salary df 
filtered_salary_df = salary_df.loc[salary_df['yearID'] > 1999]
filtered_salary_df

       yearID teamID lgID   playerID    salary
12263    2000    ANA   AL  anderga01   3250000
12264    2000    ANA   AL  belchti01   4600000
12265    2000    ANA   AL  botteke01   4000000
12266    2000    ANA   AL  clemeed02    215000
12267    2000    ANA   AL  colanmi01    200000
...       ...    ...  ...        ...       ...
25570    2015    WAS   NL  treinbl01    512800
25571    2015    WAS   NL  ugglada01    507500
25572    2015    WAS   NL  werthja01  21000000
25573    2015    WAS   NL  zimmejo02  16500000
25574    2015    WAS   NL  zimmery01  14000000

[13312 rows x 5 columns]

In [3]:
#read in csv files
salary_df = pd.read_csv(SalaryDataFile)
pd.options.display.float_format = '{:,}'.format
filtered_salary_df.describe()

                 yearID              salary
count          13,312.0            13,312.0
mean     2,007.45703125 3,032,290.930138221
std   4.605016502367647 4,157,634.461273782
min             2,000.0           165,574.0
25%             2,003.0           421,975.0
50%             2,007.0         1,000,000.0
75%             2,011.0         4,000,000.0
max             2,015.0        33,000,000.0

In [4]:
#sum salaries by year and team
sumOfSalaries = filtered_salary_df.groupby(by=['yearID','teamID'])['salary'].sum()
    
#create DataFrame from grouped data 
df = pd.DataFrame(sumOfSalaries, columns = ['yearID', 'teamID', 'salary'])
df

              yearID teamID     salary
yearID teamID
2000   ANA       NaN    NaN   51464167
       ARI       NaN    NaN   81027833
       ATL       NaN    NaN   84537836
       BAL       NaN    NaN   81447435
       BOS       NaN    NaN   77940333
...              ...    ...        ...
2015   SLN       NaN    NaN  119241500
       TBA       NaN    NaN   64521233
       TEX       NaN    NaN  143742789
       TOR       NaN    NaN  112992400
       WAS       NaN    NaN  155587472

[480 rows x 3 columns]

In [5]:
# create a new dataset with the total salary
df=filtered_salary_df[['yearID','teamID','lgID','salary']].groupby(['yearID','teamID','lgID']).sum().reset_index()
df.head()

   yearID teamID lgID    salary
0    2000    ANA   AL  51464167
1    2000    ARI   NL  81027833
2    2000    ATL   NL  84537836
3    2000    BAL   AL  81447435
4    2000    BOS   AL  77940333

In [7]:
# Calculate how many standard deviations each team's Salary spending is away from the league average for that year
# Begin with calculation for one team for one year

# Calculate the mean salary for 2000
avg_salary = round(df[(df['yearID']==2000)]['salary'].mean(),2)
print(f'Average team salary in 2000 was ${avg_salary}')

Average team salary in 2000 was $55537836.73

In [8]:
# Calculate standard deviation for salaries in 2000
salary_dev = round(df[(df['yearID']== 2000)]['salary'].std(),2)
print(f'Salary standard deviation in 2000 was ${salary_dev}')

Salary standard deviation in 2000 was $21416220.28

In [13]:
# how many standard deviations from the mean is Boston's record?
std_devs_from_mean = (df.iloc[4,:]['salary'] -avg_salary )/salary_dev
print(f"Boston's total Salary in 2000 was ${df.iloc[4,:]['salary']}, which is {round(std_devs_from_mean,2)} standard deviations away from the League average in that year")
print('Bostons salary total was above the League average')

Boston's total Salary in 2000 was $77940333, which is 1.05 standard deviations away from the League average in that year
Bostons salary total was above the League average

In [16]:
# Calculate how many standard deviations a teams salary is from the mean for a given year and returns that value
def calculate_std_salary(df,year,salary):
    #print(year)
    #return ((df[(df['yearID']==year)]['salary'].mean())-salary)/(df[(df['yearID']==year)]['salary'].std()) 
    return (salary-(df[(df['yearID']==year)]['salary'].mean()))/(df[(df['yearID']==year)]['salary'].std())

In [17]:
df['StandardizedSalary'] = df.apply(lambda row: calculate_std_salary(df, row.yearID, row.salary), axis=1 )
df.head()

   yearID teamID lgID    salary  StandardizedSalary
0    2000    ANA   AL  51464167 -0.1902142245932114
1    2000    ARI   NL  81027833  1.1902191861735574
2    2000    ATL   NL  84537836  1.3541137929212992
3    2000    BAL   AL  81447435  1.2098119058323626
4    2000    BOS   AL  77940333  1.0460527571609173

In [18]:
# Verify these calculated values for one year (2015)
print(f"Mean salary for 2015 was {df[(df['yearID']==2015)]['salary'].mean()}")
#print(f"BOS salary for 2015 was {df[(df['yearID']==2015 & df['teamID]=='BOS)]['salary']} which standardized to ")
df[(df['yearID']==2015)] #

Mean salary for 2015 was 113359437.70967741

     yearID teamID lgID     salary    StandardizedSalary
451    2015    ARI   AL    4875000    -2.425995437032669
452    2015    ARI   NL   56959000   -1.2612611303429093
453    2015    ATL   NL   71781250   -0.9297968980003034
454    2015    BAL   AL  115044833   0.03768984169748991
455    2015    BOS   AL  181103400    1.5149319743229417
456    2015    CHA   AL  112373700 -0.022043670375913395
457    2015    CHN   NL  115879310   0.05635092744442852
458    2015    CIN   NL  113072286 -0.006421462397010615
459    2015    CLE   AL   87663766   -0.5746223480089623
460    2015    COL   NL   95688600  -0.39516609531542085
461    2015    DET   AL  172284750    1.3177239220671693
462    2015    HOU   AL   72256200   -0.9191757752185988
463    2015    KCA   AL  112107025 -0.028007220050218204
464    2015    LAA   AL  120005415    0.1486214144750742
465    2015    LAN   NL  215792000    2.2906596924520866
466    2015    MIA   NL   68056500   -1.0130920387122817
467    2015    MIL   NL  100850000   -0.2797437074314541
468    2015    MIN   AL  107755000  -0.12532986848489105
469    2015    NYA   AL  212751957     2.222676389020859
470    2015    NYN   NL   96766683  -0.37105734300071735
471    2015    OAK   AL   79053501   -0.7671703672699657
472    2015    PHI   NL  111693000  -0.03726590066858906
473    2015    PIT   NL   88892499   -0.5471446681291177
474    2015    SDN   NL  118441300   0.11364371690752845
475    2015    SEA   AL  122208700   0.19789262304037156
476    2015    SFN   NL  164701500    1.1481426412284257
477    2015    SLN   NL  119241500    0.1315382793876211
478    2015    TBA   AL   64521233   -1.0921498445299644
479    2015    TEX   AL  143742789    0.6794511097466648
480    2015    TOR   AL  112992400 -0.008207922054951982
481    2015    WAS   NL  155587472    0.9443291652332823

In [15]:
# create a new dataset with the total salary by team by league 
df=filtered_salary_df[['yearID','teamID','lgID' == BAL, BOS, NYA, TOR. FLO,'salary']].groupby(['yearID','teamID','lgID']).sum().reset_index()
df.head()

NameError: name 'BAL' is not defined

In [10]:
# Preview Boston's record for 2000
df.iloc[4,:]

yearID        2000
teamID         BOS
lgID            AL
salary    77940333
Name: 4, dtype: object

In [ ]:
al_east_team_dict={
    'BAL':'#FF6F1C', 
    'BOS':'#FFB627',
    'NYA':'#223843', 
    'TOR':'#1f77b4', 
    'FLO':'#FFCAD4'
}

In [ ]:
# dictionaries for all leagues

al_central_team_dict={
    'CLE':'#FF6F1C', 
    'MIN':'#FFB627',
    'DET':'#223843', 
    'CHA':'#1f77b4', 
    'KCA':'#FFCAD4'
}
al_west_team_dict={
    'HOU':'#FF6F1C', 
    'OAK':'#FFB627',
    'SEA':'#223843', 
    'LAN':'#1f77b4', 
    'TEX':'#FFCAD4'
}

nl_central_team_dict={
    'ML4':'#FF6F1C', 
    'CHN':'#FFB627',
    'SLN':'#223843', 
    'PIT':'#1f77b4', 
    'CIN':'#FFCAD4'
}
nl_west_team_dict={
    'LAN':'#FF6F1C', 
    'COL':'#FFB627',
    'ARI':'#223843', 
    'SFN':'#1f77b4', 
    'SDN':'#FFCAD4'
}
nl_east_team_dict={
    'ATL':'#FF6F1C', 
    'WAS':'#FFB627',
    'PHI':'#223843', 
    'NYN':'#1f77b4', 
    'MIA':'#FFCAD4'
}

In [ ]:
league_list = [al_east_team_dict, al_central_team_dict,al_west_team_dict, nl_east_team_dict, nl_central_team_dict, nl_west_team_dict]

In [ ]:
# create a plot that's 6 rows and 5 columns wide
fig, ax = plt.subplots(nrows=6, ncols=5,figsize=(15,15),sharex=True, sharey=True)

# set an overall title for the plot
fig.suptitle('MLB: Spend more, Win more?', ha='center',color = 'grey',fontsize=20,va='top',) 

# help the subplots fit better
fig.subplots_adjust(hspace = .5, wspace=.001)

#ax[count[pos]:  the axes object contains a numpy array for each row with 5 sub plots (count indicates the row and pos indicates the column)
count = 0 # sets the row to be filled 
for league in league_list:
    pos=0 # sets the column to be filled by a given team in the division
    for team,color in league.items():
        plot_team_row(df_merged[(df_merged['teamID']==team)], ax[count][pos],color)
        pos=pos+1
    count += 1